Task Management/app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)
    if @project.save
---
INSERT INTO "projects" ("name", "created_at", "updated_at", "description", "start_date", "end_date") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "Топ проект"], ["created_at", "2023-12-27 09:26:13.663817"], ["updated_at", "2023-12-27 09:26:13.663817"], ["description", "1"], ["start_date", "2023-12-27"], ["end_date", "2023-12-29"]]