Task Management/app/controllers/tasks_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @project = Project.find(params[:project_id])
    @task = Task.find(params[:id])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "tasks" ("name", "description", "status", "project_id", "created_at", "updated_at", "deadline") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @project = Project.find(params[:project_id])
    @task = @project.tasks.build(task_params)

    if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status", 2], ["updated_at", "2023-12-27 13:02:14.268278"], ["id", 15]]
---
  def update_status
    @task = Task.find(params[:id])
    if @task.update(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
  def set_project
    @task = Task.find(params[:id])